// ### 1. Напишіть функцію bmi, яка обчислює індекс маси тіла `(bmi = weight / height ^ 2)`

// - якщо менше аніж 18.5 => "Недостатня вага"
// - якщо менше або дорівнює 25.0 => "Норма"
// - якщо менше або дорівнює 30.0 return => "Надмірна вага"
// - якщо більше 30 return => "Ожиріння"

// function calcBmi(weight, height) {
//   const result = (replace(weight) / (replace(height) ^ 2)).toFixed(1);
//   if (result < 18.5) {
//     return "Недостатня вага";
//   } else if (result <= 25.0) {
//     return "Норма";
//   } else if (result <= 30.0) {
//     return "Надмірна вага";
//   } else {
//     return "Ожиріння";
//   }
// }

// function replace(value) {
//   return value.replace(",", ".");
// }

// const weight = "82,0"; // можеш задавати довільне число
// const height = "1.80"; // можеш задавати довільне число

// console.log(calcBmi(weight, height));

// **

// ### 2. Напиши скрипт, який виконує наступний функціонал:

// На рахунку користувача є `23580` кредитів, значення зберігається в змінній `credits` (створи і привласни). Користувач вирішує купити ремонтних дроїд, які коштують по `3000` кредитів за штуку. Ціна одного дроїда зберігається в змінній `pricePerDroid` (створи і привласни).

// При відвідуванні сторінки, використовуючи `prompt`, необхідно запитати кількість
// дроїдів, які користувач хоче купити і зберегти в змінну.

// Напиши скрипт який:

// - Якщо в `prompt` була натиснута кнопка `Cancel`, виводить в консоль
//   повідомлення `'Скасовано користувачем!'`.
// - В іншому випадку, розраховує загальну ціну замовлення і зберігає в змінній
//   `totalPrice`.
// - Перевіряє чи зможе користувач оплатити замовлення:
//   - якщо сума до оплати перевищує кількість кредитів на рахунку, виводь в
//     консоль повідомлення `'Недостатньо коштів на рахунку!'`.
//   - в іншому випадку необхідно порахувати залишок кредитів на рахунку і вивести
//     повідомлення
//     `'Ви купили [число] дроїдів, на рахунку залишилося [число] кредитів.'`.

// function buyDroid() {
//   let credits = 23580;
//   const pricePerDroid = 3000;
//   const userValue = prompt("яку кількість дроїдів ви хочете купити?");

//   if (!userValue) {
//     console.log("Скасовано користувачем!");
//     return;
//   }

//   const totalPrice = userValue * pricePerDroid;

//   if (totalPrice > credits) {
//     console.log("Недостатньо коштів на рахунку!");
//     return;
//   } else {
//     credits -= totalPrice;
//     console.log(
//       `Ви купили ${userValue} дроїдів на суму ${totalPrice}, на рахунку залишилося ${credits} кредитів.`
//     );
//   }
// }

// buyDroid();
